import React from "react";
import logoImg from "/src/assets/logo_blue.webp";
import { Link } from "react-router-dom";
const Confidentiality = () => {
  return (
    <div className="contain official">
      <Link to="/">
        <img
          src={logoImg}
          alt="logo"
          className="navLogo"
          style={{ padding: "30px" }}
        />
      </Link>
      <div className="ofertaTitle">
        <h1
          style={{
            color: "black",
            lineHeight: "normal",
            textAlign: "center",
            fontWeight: "650",
            margin: "0",
          }}
          className="confidentialityOfertaTitle"
        >
          Политика конфиденциальности пользователей сайта Vunderkids.kz
        </h1>
      </div>
      <div className="ofertaContent">
        <h3 class="section-title">1. Общие положения</h3>
        <p>
          <strong>1.1.</strong> Настоящая Политика конфиденциальности (далее –
          Политика) регулирует отношения между пользователями сайта (далее –
          Пользователь) и администрацией сайта (далее – Администрация) в
          отношении обработки персональных данных, осуществляемой в соответствии
          с законодательством Республики Казахстан (далее – РК).
        </p>
        <p>
          <strong>1.2.</strong> Пользователь, используя сайт, выражает свое
          согласие с условиями настоящей Политики и дает согласие на обработку
          своих персональных данных.
        </p>

        <h3 class="section-title">
          2. Персональные данные, обрабатываемые Администрацией
        </h3>
        <p>
          <strong>2.1.</strong> Персональные данные – любая информация,
          относящаяся к прямо или косвенно определенному или определяемому
          физическому лицу (субъекту персональных данных).
        </p>
        <p>
          <strong>2.2.</strong> Администрация обрабатывает следующие
          персональные данные Пользователя:
        </p>
        <ul>
          <li>Фамилия, имя, отчество;</li>
          <li>
            Контактная информация (номер телефона, адрес электронной почты);
          </li>
          <li>Данные о посещениях и использовании сайта;</li>
          <li>
            Информация, предоставленная Пользователем при заполнении форм на
            сайте.
          </li>
        </ul>

        <h3 class="section-title">3. Цели обработки персональных данных</h3>
        <p>
          <strong>3.1.</strong> Администрация обрабатывает персональные данные
          Пользователя для следующих целей:
        </p>
        <ul>
          <li>Обеспечение функционирования сайта и предоставление услуг;</li>
          <li>Идентификация Пользователя;</li>
          <li>Обратная связь с Пользователем;</li>
          <li>Улучшение качества услуг и контента сайта;</li>
          <li>Выполнение требований законодательства РК.</li>
        </ul>

        <h3 class="section-title">
          4. Правовые основания обработки персональных данных
        </h3>
        <p>
          <strong>4.1.</strong> Обработка персональных данных Пользователя
          осуществляется на основании:
        </p>
        <ul>
          <li>Согласия Пользователя на обработку его персональных данных;</li>
          <li>
            Необходимости выполнения договора, стороной которого является
            Пользователь;
          </li>
          <li>
            Необходимости выполнения обязательств, установленных
            законодательством РК.
          </li>
        </ul>

        <h3 class="section-title">
          5. Порядок сбора, хранения и защиты персональных данных
        </h3>
        <p>
          <strong>5.1.</strong> Персональные данные Пользователя обрабатываются
          автоматизированным и неавтоматизированным способами.
        </p>
        <p>
          <strong>5.2.</strong> Администрация принимает необходимые
          организационные и технические меры для защиты персональных данных
          Пользователя от неправомерного или случайного доступа, уничтожения,
          изменения, блокирования, копирования, распространения, а также от иных
          неправомерных действий.
        </p>

        <h3 class="section-title">6. Права Пользователя</h3>
        <p>
          <strong>6.1.</strong> Пользователь имеет право:
        </p>
        <ul>
          <li>
            Получать информацию о своих персональных данных, обрабатываемых
            Администрацией;
          </li>
          <li>
            Требовать уточнения своих персональных данных, их блокирования или
            уничтожения в случае, если данные являются неполными, устаревшими,
            неточными, незаконно полученными или не являются необходимыми для
            заявленной цели обработки;
          </li>
          <li>Отозвать свое согласие на обработку персональных данных;</li>
          <li>
            Обращаться с жалобами на действия Администрации по обработке его
            персональных данных в уполномоченные органы.
          </li>
        </ul>

        <h3 class="section-title">
          7. Передача персональных данных третьим лицам
        </h3>
        <p>
          <strong>7.1.</strong> Администрация не передает персональные данные
          Пользователя третьим лицам без его согласия, за исключением случаев,
          предусмотренных законодательством РК.
        </p>

        <h3 class="section-title">8. Изменение Политики</h3>
        <p>
          <strong>8.1.</strong> Администрация оставляет за собой право изменять
          настоящую Политику в любое время. Измененная Политика вступает в силу
          с момента ее опубликования на сайте.
        </p>

        <h3 class="section-title">9. Контактная информация</h3>
        <p>
          <strong>9.1.</strong> Все вопросы и обращения, касающиеся обработки
          персональных данных, Пользователь может направлять по следующему
          адресу: Казахстан, Астана, Проспент Нургиса Тлендиева, дом 15/4,
          кв/офис 97.
        </p>

        <h3 class="section-title">10. Заключительные положения</h3>
        <p>
          <strong>10.1.</strong> Настоящая Политика разработана в соответствии с
          законодательством РК и является обязательной для исполнения всеми
          сотрудниками Администрации, работающими с персональными данными
          Пользователей.
        </p>
      </div>
    </div>
  );
};

export default Confidentiality;
